app/controllers/menus_controller.rb

SELECT "menus".* FROM "menus"
---
  def index
    @menus = Menu.all

INSERT INTO "menus" ("date", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["date", Fri, 25 Aug 2017], ["created_at", 2017-08-25 22:09:19 UTC], ["updated_at", 2017-08-25 22:09:19 UTC]]
---
  def create
    @form = MenuForm.new(Menu.new)
    if @form.validate(params[:menu]) && @form.save